{
  "portfolio": " This is my portfolio page! Initially I just wanted to make something where I could keep track of my own projects, skill progression,etc. Although as the project progressed I realised It would be a good starting point to build a portfolio page on. \n\n I took this opportunity to display my web development and design skills for a portfolio, most portfolios I see seem to be overloaded with interactivity and cluttered npm packages, I wanted to keep it relatively simple and readable. While there is always a time and a place for fancy packages I feel they’re often overused when a more simple system can be used to achieve the same goal. \n\n For the development of this page I used React, typescript and styled a vast majority of the components myself.",
  "UKBETA": "This is a mod I’ve been working on for the game Hearts of Iron 4. A mod is a community made expansion for the game to bring new content and features to the experience. Hearts of iron is originally a World war 2 strategy game, simulating the entire planet throughout the conflict. The player chooses a country to control. They control the government, infrastructure, construction, armies, all aspects of a country. The player can then alter the course of the war depending on their actions.\n\nThis mod I’m working on aims to completely overhaul the game, turning it from a map of the planet to the map of the UK for a UK civil war. I want it to be relatively light hearted and comedic, featuring things like a civil war between Noel and Liam Gallagher, A wetherspoons empire and various other references to British media / culture.\n\nCurrently I’m aiming to make this project open source to the HOI4 community once I’ve released the public beta.\n\n27/04/2023\n\nCurrently I’ve been working on this for around 3 months. In this time I’ve redesigned the map, and individual provinces, states, strategic regions, victory points and added most of the countries. This has consisted so far of 4300 individual files, and 51 commits on git. I’ve got a long way to go.",
  "MIDDLEMAN" : "SteamMiddleMan is an web application designed to facilitate secure and efficient item trading within the Steam gaming platform. With a strong emphasis on user authentication and safety, SteamMiddleMan leverages OpenID for smooth and trustworthy login experiences, ensuring users can easily sign into their Steam accounts. Currently it is still in development with most of the main features and building blocks ready. Things like a comprehensive UI, security testing and bug fixes need to take place.\n\nKey Features:\n\n1. OpenID Integration: SteamMiddleMan streamlines the login process through OpenID, enabling users to access their Steam accounts seamlessly and securely.\n\n2. Item Trading Platform: Once authenticated, SteamMiddleMan allows users to initiate trades with other platform participants. Gamers can select items from their Steam inventory and propose trade offers to interested parties.\n\n3. Trade Escrow System: To ensure fair and transparent transactions, SteamMiddleMan implements an escrow system. The platform temporarily holds the traded items until the agreed-upon fee is paid by the user initiating the trade, ensuring both parties fulfill their commitments.\n\n4. Robust Technology Stack: SteamMiddleMan utilises cutting-edge technologies such as JavaScript, NodeJS, and postgreSQL to deliver a reliable and secure trading environment. This tech stack guarantees the protection of user data and facilitates smooth and real-time interactions between traders."
}
